export const getStaticURL = () => process.env.NEXT_PUBLIC_STATIC_URL;

export enum THEME {
    LIGHT = "light",
    DARK = "dark",
}

export const LEFT_HEADER_DATA = [
  {
    label: "MENU",
    link: "/",
  },
  {
    label: "MENU ĐẶC BIỆT",
    link: "/",
  },
  {
    label: "ĐỊA ĐIỂM",
    link: "/",
  },
];

export const RIGHT_HEADER_DATA = [
  {
    label: "GIỚI THIỆU",
    link: "/",
  },
  {
    label: "ĐẶT BÀN",
    link: "/",
  },
  {
    label: "THEO DÕI",
    link: "/",
  },
];

export const FOOTER_DATA = [
    {
      page: "explore",
      title: "Khám phá",
      itemFooter: [
        {
          label: "Về chúng tôi",
          link: "/",
        }
      ],
    },
    {
      page: "help",
      title: "Hỗ trợ",
      itemFooter: [
        {
          label: "FAQ",
          link: "/",
        },
        {
          label: "Dịch vụ",
          link: "/",
        },
        {
            label: "Tư vấn",
            link: "/",
          },
      ],
    },
];

export const CONTACT_DATA = [
    {
        label: "1234567890",
        d: ["M11.9523 0.61084H12.0474C16.2958 0.730626 19.3252 1.33652 21.1359 2.42857C23.0452 3.58403 23.9999 4.76064 23.9999 5.95823C23.7462 7.03618 23.2566 7.57517 22.5309 7.57517C22.4886 7.57518 22.4428 7.57165 22.3935 7.5646L18.0924 6.08507C17.6696 5.95827 17.4583 5.74338 17.4583 5.44042C17.4583 5.30657 17.5005 5.15157 17.5851 4.97542C18.0642 4.47522 18.3037 4.11238 18.3037 3.88691C18.3037 3.72489 18.1839 3.63329 17.9444 3.61215H6.06601C5.82646 3.63329 5.70669 3.72488 5.70671 3.88691C5.7067 4.11238 5.94624 4.4752 6.42532 4.97542C6.50986 5.14452 6.55213 5.29951 6.55214 5.44042C6.55213 5.74338 6.33725 5.95826 5.90748 6.08507L1.60633 7.5646C1.55701 7.57165 1.51122 7.57518 1.46895 7.57517C0.750316 7.57518 0.260666 7.03621 0 5.95823C-1.503e-06 4.76053 0.958166 3.58394 2.8745 2.42857C4.67811 1.35065 7.704 0.744758 11.9523 0.61084ZM14.4991 4.97542V4.18282H16.0209V5.78909C16.0209 6.3175 16.8698 6.78248 18.5677 7.18406C20.1952 7.85337 21.0089 9.19553 21.0089 11.2105V16.3888H2.99088V11.2105C2.99087 9.19553 3.80814 7.85334 5.44258 7.18406C7.13346 6.78248 7.9789 6.31748 7.9789 5.78909V4.18282H9.51122V4.97542H14.4991ZM7.70385 10.7561C7.70385 11.9327 8.11952 12.9331 8.95088 13.7575C9.78223 14.5818 10.7791 14.9939 11.9416 14.9939C13.1252 14.9939 14.1292 14.5818 14.9534 13.7575C15.7777 12.9332 16.1899 11.9327 16.1899 10.7561C16.1899 9.58661 15.7795 8.58624 14.9587 7.75478C14.1379 6.92344 13.1323 6.50776 11.9416 6.50775C10.765 6.50776 9.76464 6.92344 8.94024 7.75478C8.11593 8.58614 7.70385 9.58664 7.70385 10.7561ZM14.3195 10.7456C14.3195 11.4008 14.0887 11.9609 13.6273 12.4259C13.1658 12.8909 12.6039 13.1234 11.9417 13.1234C11.2864 13.1234 10.7281 12.8909 10.2666 12.4259C9.80507 11.9609 9.57435 11.4008 9.57435 10.7456C9.57433 10.0763 9.80507 9.51087 10.2666 9.04942C10.728 8.58795 11.2864 8.35722 11.9417 8.35721C12.6039 8.35722 13.1658 8.58795 13.6273 9.04942C14.0887 9.5109 14.3195 10.0763 14.3195 10.7456Z"],
    },
    {
        label: "Abc đường số 1, Phường 2, Quận 3, Thành phố Hồ Chí Minh",
        d: ["M12 14C12.55 14 13.0208 13.8042 13.4125 13.4125C13.8042 13.0208 14 12.55 14 12C14 11.45 13.8042 10.9792 13.4125 10.5875C13.0208 10.1958 12.55 10 12 10C11.45 10 10.9792 10.1958 10.5875 10.5875C10.1958 10.9792 10 11.45 10 12C10 12.55 10.1958 13.0208 10.5875 13.4125C10.9792 13.8042 11.45 14 12 14ZM12 24C9.31667 21.7167 7.3125 19.5958 5.9875 17.6375C4.6625 15.6792 4 13.8667 4 12.2C4 9.7 4.80417 7.70833 6.4125 6.225C8.02083 4.74167 9.88333 4 12 4C14.1167 4 15.9792 4.74167 17.5875 6.225C19.1958 7.70833 20 9.7 20 12.2C20 13.8667 19.3375 15.6792 18.0125 17.6375C16.6875 19.5958 14.6833 21.7167 12 24Z"],
    },
    {
        label: "email@gmail.com",
        d: ["M4 20.5C3.45 20.5 2.97917 20.3042 2.5875 19.9125C2.19583 19.5208 2 19.05 2 18.5V6.5C2 5.95 2.19583 5.47917 2.5875 5.0875C2.97917 4.69583 3.45 4.5 4 4.5H20C20.55 4.5 21.0208 4.69583 21.4125 5.0875C21.8042 5.47917 22 5.95 22 6.5V18.5C22 19.05 21.8042 19.5208 21.4125 19.9125C21.0208 20.3042 20.55 20.5 20 20.5H4ZM12 13.5L20 8.5V6.5L12 11.5L4 6.5V8.5L12 13.5Z"],
    }
];

export const COMBO_MENU = [
  {
    name: "Combo BBQ Tây Bắc",
    banner: "grilled-meat.svg",
    desc: "Lorem ipsum dolor sit amet consectetur. Justo ante pulvinar eget vitae cursus. Mauris ultrices aenean hac sed velit elementum ultrices iaculis. Commodo nec amet sed lobortis sed non vitae. Mattis scelerisque nisi tellus morbi sed sed. Mi.",
    collect: [
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
    ],
    price: "500.000Đ"
  },
  {
    name: "Combo BBQ Đà Lạt",
    banner: "grilled-meat.svg",
    desc: "Lorem ipsum dolor sit amet consectetur. Justo ante pulvinar eget vitae cursus. Mauris ultrices aenean hac sed velit elementum ultrices iaculis. Commodo nec amet sed lobortis sed non vitae. Mattis scelerisque nisi tellus morbi sed sed. Mi.",
    collect: [
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
    ],
    price: "500.000Đ"
  },
  {
    name: "Combo 3",
    banner: "grilled-meat.svg",
    desc: "Lorem ipsum dolor sit amet consectetur. Justo ante pulvinar eget vitae cursus. Mauris ultrices aenean hac sed velit elementum ultrices iaculis. Commodo nec amet sed lobortis sed non vitae. Mattis scelerisque nisi tellus morbi sed sed. Mi.",
    collect: [
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
    ],
    price: "500.000Đ"
  },
  {
    name: "Combo 4",
    banner: "grilled-meat.svg",
    desc: "Lorem ipsum dolor sit amet consectetur. Justo ante pulvinar eget vitae cursus. Mauris ultrices aenean hac sed velit elementum ultrices iaculis. Commodo nec amet sed lobortis sed non vitae. Mattis scelerisque nisi tellus morbi sed sed. Mi.",
    collect: [
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
      "Lorem ipsum dolor sit amet consectetur.",
    ],
    price: "500.000Đ"
  }
];

export const SERVICE_DATA = [
  {
    name: "Giao hành nhanh chóng",
    content: "Giao hàng trong 30 phút",
  },
  {
    d: [
      "M28 5.16675C15.134 5.16675 4.66663 15.6341 4.66663 28.5001V30.1661V37.8334V38.1671C4.66663 40.5564 6.75963 42.5001 9.33329 42.5001H11.6666C12.957 42.5001 14 41.4548 14 40.1668V28.1664C14 26.8784 12.957 25.8331 11.6666 25.8331H9.54796C10.8453 16.8031 18.6153 9.83342 28 9.83342C37.3846 9.83342 45.1546 16.8031 46.452 25.8331H44.3333C43.043 25.8331 42 26.8784 42 28.1664V37.8334V40.1668V42.5001C42 45.0737 39.907 47.1668 37.3333 47.1668H32.6666V44.8334H23.3333V51.8334H28H32.6666H37.3333C42.4806 51.8334 46.6666 47.6474 46.6666 42.5001C49.2403 42.5001 51.3333 40.5564 51.3333 38.1671V37.8334V30.1661V28.5001C51.3333 15.6341 40.866 5.16675 28 5.16675Z"
    ],
    name: "Hỗ trợ nhiệt tình",
    content: "Hỗ trợ đổi trả nếu giao sai hàng",
  },
  {
    d: [
      "M52.528 31.0733V35.4973C52.528 36.6173 51.576 37.5133 50.512 37.5133H48.328C47.936 34.8813 45.64 32.8093 42.896 32.8093C40.096 32.8093 37.8 34.8813 37.408 37.5133H19.152C18.76 34.8813 16.464 32.8093 13.664 32.8093C10.864 32.8093 8.62395 34.8813 8.23195 37.5133H5.54395C4.42395 37.5133 3.52795 36.6173 3.52795 35.4973V31.0733H52.528ZM17.36 20.3213H16.184L15.792 22.5053H16.912C17.64 22.5053 18.256 22.0013 18.256 21.1053C18.256 20.6013 17.92 20.3213 17.36 20.3213ZM47.04 38.3533C47.04 40.6493 45.192 42.4973 42.896 42.4973C40.544 42.4973 38.696 40.6493 38.696 38.3533C38.696 36.0013 40.544 34.1533 42.896 34.1533C45.192 34.1533 47.04 36.0013 47.04 38.3533ZM44.968 38.3533C44.968 37.1773 44.016 36.2253 42.896 36.2253C41.72 36.2253 40.824 37.1773 40.824 38.3533C40.824 39.4733 41.72 40.4253 42.896 40.4253C44.016 40.4253 44.968 39.4733 44.968 38.3533ZM17.864 38.3533C17.864 40.6493 15.96 42.4973 13.664 42.4973C11.368 42.4973 9.51995 40.6493 9.51995 38.3533C9.51995 36.0013 11.368 34.1533 13.664 34.1533C15.96 34.1533 17.864 36.0013 17.864 38.3533ZM15.736 38.3533C15.736 37.1773 14.84 36.2253 13.664 36.2253C12.488 36.2253 11.592 37.1773 11.592 38.3533C11.592 39.4733 12.544 40.4253 13.664 40.4253C14.784 40.4253 15.736 39.4733 15.736 38.3533ZM52.528 29.9533H3.52795V16.5133C3.52795 15.3933 4.42395 14.4973 5.48795 14.4973H35.896C37.016 14.4973 37.912 15.3933 37.912 16.5133V17.9693H41.944C42.616 17.9693 43.288 18.2493 43.792 18.7533L51.688 26.5933C52.192 27.0973 52.472 27.7693 52.472 28.4973L52.528 29.9533ZM10.64 22.2813L11.032 20.3213H13.776L13.944 19.2573H9.96795L8.62395 26.2013H9.85595L10.416 23.4013H12.768L12.936 22.2813H10.64ZM17.976 23.2333C19.04 22.8973 19.544 21.8893 19.544 20.9373C19.544 20.2093 19.208 19.6493 18.648 19.4253C18.312 19.3133 17.976 19.2573 17.64 19.2573H15.176L13.832 26.2013H15.064L15.568 23.6253H16.856L17.696 26.2013H19.04L18.144 23.6253C18.032 23.3453 17.976 23.2333 17.976 23.2333ZM25.704 19.2573H21.56L20.16 26.2013H24.472L24.696 25.0813H21.672L22.008 23.2333H24.36L24.584 22.1693H22.232L22.568 20.3213H25.48L25.704 19.2573ZM31.304 19.2573H27.16L25.816 26.2013H30.128L30.296 25.0813H27.272L27.608 23.2333H29.96L30.184 22.1693H27.832L28.168 20.3213H31.08L31.304 19.2573ZM48.496 26.3133L42.28 20.3773C42.224 20.3213 42.168 20.3213 42.056 20.3213H40.6C40.432 20.3213 40.32 20.4333 40.32 20.6013V26.5373C40.32 26.7053 40.432 26.8173 40.6 26.8173H48.272C48.552 26.8733 48.664 26.4813 48.496 26.3133Z"
    ],
    name: "Miễn phí giao hàng",
    content: "Miễn phí giao hàng trong phạm vi 5km",
  }
];

export const OUTSTANDING_IMAGE = ["bbq.svg", "buffet.svg", "grilled-sausage.svg"];